const testPost = {
    cuid: 1,
    title: "溫柔親人公橘送養",
    cover: "../../testImages/cat01.jpg",
    story: `「昨天」在前陣子很寒冷的天氣
    幸運的在樓梯間被尋獲
    瑟縮在樓梯間的她.....換得幸運的暫時安置
    但中途不是終途
    這麼乖的孩子值得擁有一個永遠的家
    孩子一樣在中途等家
    雖然有溫足的三餐沒有危險之虞
    但畢竟沒有家人的疼愛
    孩子很惜福... 總是很乖的嬰兒抱塞奶
    放風時的時間畢竟有限
    除了放風時間「昨天」也只能待在籠子裡`,
    charactor: `活潑聰明 不貪吃 愛喝水
    脾氣非常好 不咬不伸爪
    被抓腳抓尾巴亂揉都不生氣
    個性黏人親人
    不管你做什麼都喜歡跟你待在一起
    只要有機會 就想要趴到你身上
    也喜歡被摸被嬰兒抱
    是個不甘寂寞的塞奶怪
    很適合作為陪伴型寵物
    也很適合新手飼養`,
    city: "台北市",
    district: "松山區",
    age: "4",
    gender: "1",
    isSpay: "true",
    requirements: [
        '須年滿20歲',
        '須經家人或室友同意',
        '須具備經濟能力，包括預防針、貓咪生病時的醫藥費負擔',
        '不排斥養貓新手，但須有正確的飼養觀念',
        '須同意一週的試養期',
        '須接受定期追蹤',
        '須同意簽認養切結書',
        `公貓最常見的疾病為下泌尿道問題，原因為公貓的尿道比母貓細又窄，水量攝取不足長期將形成結晶、結石並造成尿道口阻塞，水量攝取過少也容易造成慢性脫水、腎衰竭等疾病，母貓抑是，因此 #送養將只考慮全濕食家庭`
    ],
    contact: "林小姐",
    phoneNumber: "0912345678",
    postDate: "2018-3-30 18:20"
};

export default testPost;