const taiwanDistricts = [
    {
        city: '台北市',
        districts: 
            `0101 松山區	0102 大安區	0109 大同區	0110 中山區
            0111 內湖區	0112 南港區	0115 士林區	0116 北投區
            0117 信義區	0118 中正區	0119 萬華區	0120 文山區`
    },
    {
        city: '台中市',
        districts: 
            `0301 豐原區	0302 東勢區	0303 大甲區	0304 清水區
            0305 沙鹿區	0306 梧棲區	0307 后里區	0308 神岡區
            0309 潭子區	0310 大雅區	0311 新社區	0312 石岡區
            0313 外埔區	0314 大安區	0315 烏日區	0316 大肚區
            0317 龍井區	0318 霧峰區	0319 太平區	0320 大里區
            0321 和平區	0322 中區	0323 東區	0324 西區
            0325 南區	0326 北區	0327 西屯區	0328 南屯區
            0329 北屯區
        `
    },
    {
        city: '台南市',
        districts: 
            `0501 新營區	0502 鹽水區	0503 白河區	0504 麻豆區
            0505 佳里區	0506 新化區	0507 善化區	0508 學甲區
            0509 柳營區	0510 後壁區	0511 東山區	0512 下營區
            0513 六甲區	0514 官田區	0515 大內區	0516 西港區
            0517 七股區	0518 將軍區	0519 北門區	0520 新市區
            0521 安定區	0522 山上區	0523 玉井區	0524 楠西區
            0525 南化區	0526 左鎮區	0527 仁德區	0528 歸仁區
            0529 關廟區	0530 龍崎區	0531 永康區	0532 東區
            0533 南區	0534 中西區	0535 北區	0537 安南區
            0538 安平區`
    },
    {
        city: '高雄市',
        districts: 
            `0701 鳳山區	0702 岡山區	0703 旗山區	0704 美濃區
            0705 林園區	0706 大寮區	0707 大樹區	0708 仁武區
            0709 大社區	0710 鳥松區	0711 橋頭區	0712 燕巢區
            0713 田寮區	0714 阿蓮區	0715 路竹區	0716 湖內區
            0717 茄萣區	0718 永安區	0719 彌陀區	0720 梓官區
            0721 六龜區	0722 甲仙區	0723 杉林區	0724 內門區
            0725 茂林區	0726 桃源區	0727 那瑪夏區	0728 鹽埕區
            0729 鼓山區	0730 左營區	0731 楠梓區	0732 三民區
            0733 新興區	0734 前金區	0735 苓雅區	0736 前鎮區
            0737 旗津區	0738 小港區`
    },
    {
        city: '基隆市',
        districts: 
            `1101 中正區	1102 七堵區	1103 暖暖區	1104 仁愛區
            1105 中山區	1106 安樂區	1107 信義區`
    },
    {
        city: '新竹市',
        districts:
            `1201 東區	1204 北區	1205 香山區`
    },
    {
        city: '嘉義市',
        districts:
            `2201 東區	2202 西區`
    },
    {
        city: '新北市',
        districts:
            `3101 板橋區	3102 三重區	3103 永和區	3104 中和區
            3105 新店區	3106 新莊區	3107 樹林區	3108 鶯歌區
            3109 三峽區	3110 淡水區	3111 汐止區	3112 瑞芳區
            3113 土城區	3114 蘆洲區	3115 五股區	3116 泰山區
            3117 林口區	3118 深坑區	3119 石碇區	3120 坪林區
            3121 三芝區	3122 石門區	3123 八里區	3124 平溪區
            3125 雙溪區	3126 貢寮區	3127 金山區	3128 萬里區
            3129 烏來區`
    },
    {
        city: '桃園市',
        districts: 
            `3201 桃園區	3202 中壢區	3203 大溪區	3204 楊梅區
            3205 蘆竹區	3206 大園區	3207 龜山區	3208 八德區
            3209 龍潭區	3210 平鎮區	3211 新屋區	3212 觀音區
            3213 復興區`
    },
    {
        city: '新竹縣',
        districts:
            `3301 關西鎮	3302 新埔鎮	3303 竹東鎮	3305 竹北市
            3306 湖口鄉	3307 橫山鄉	3308 新豐鄉	3309 芎林鄉
            3310 寶山鄉	3311 北埔鄉	3312 峨眉鄉	3313 尖石鄉
            3314 五峰鄉`
    },
    {
        city: '宜蘭縣',
        districts:
            `3401 宜蘭市	3402 羅東鎮	3403 蘇澳鎮	3404 頭城鎮
            3405 礁溪鄉	3406 壯圍鄉	3407 員山鄉	3408 冬山鄉
            3409 五結鄉	3410 三星鄉	3411 大同鄉	3412 南澳鄉`
    },
    {
        city: '苗栗縣',
        districts:
            `3501 苗栗市	3502 苑裡鎮	3503 通霄鎮	3504 竹南鎮
            3505 頭份市	3506 後龍鎮	3507 卓蘭鎮	3508 大湖鄉
            3509 公館鄉	3510 銅鑼鄉	3511 南庄鄉	3512 頭屋鄉
            3513 三義鄉	3514 西湖鄉	3515 造橋鄉	3516 三灣鄉
            3517 獅潭鄉	3518 泰安鄉`
    },
    {
        city: '彰化縣',
        districts:
            `3701 彰化市	3702 鹿港鎮	3703 和美鎮	3704 北斗鎮
            3705 員林市	3706 溪湖鎮	3707 田中鎮	3708 二林鎮
            3709 線西鄉	3710 伸港鄉	3711 福興鄉	3712 秀水鄉
            3713 花壇鄉	3714 芬園鄉	3715 大村鄉	3716 埔鹽鄉
            3717 埔心鄉	3718 永靖鄉	3719 社頭鄉	3720 二水鄉
            3721 田尾鄉	3722 埤頭鄉	3723 芳苑鄉	3724 大城鄉
            3725 竹塘鄉	3726 溪州鄉`
    },
    {
        city: '南投縣',
        districts:
            `3801 南投市	3802 埔里鎮	3803 草屯鎮	3804 竹山鎮
            3805 集集鎮	3806 名間鄉	3807 鹿谷鄉	3808 中寮鄉
            3809 魚池鄉	3810 國姓鄉	3811 水里鄉	3812 信義鄉
            3813 仁愛鄉`
    },
    {
        city: '雲林縣',
        districts:
            `3901 斗六市	3902 斗南鎮	3903 虎尾鎮	3904 西螺鎮
            3905 土庫鎮	3906 北港鎮	3907 古坑鄉	3908 大埤鄉
            3909 莿桐鄉	3910 林內鄉	3911 二崙鄉	3912 崙背鄉
            3913 麥寮鄉	3914 東勢鄉	3915 褒忠鄉	3916 台西鄉
            3917 元長鄉	3918 四湖鄉	3919 口湖鄉	3920 水林鄉`
    },
    {
        city: '嘉義縣',
        districts:
            `4001 朴子市	4002 布袋鎮	4003 大林鎮	4004 民雄鄉
            4005 溪口鄉	4006 新港鄉	4007 六腳鄉	4008 東石鄉
            4009 義竹鄉	4010 鹿草鄉	4011 太保市	4012 水上鄉
            4013 中埔鄉	4014 竹崎鄉	4015 梅山鄉	4016 番路鄉
            4017 大埔鄉	4018 阿里山鄉`
    },
    {
        city: '屏東縣',
        districts:
            `4301 屏東市	4302 潮州鎮	4303 東港鎮	4304 恆春鎮
            4305 萬丹鄉	4306 長治鄉	4307 麟洛鄉	4308 九如鄉
            4309 里港鄉	4310 鹽埔鄉	4311 高樹鄉	4312 萬巒鄉
            4313 內埔鄉	4314 竹田鄉	4315 新埤鄉	4316 枋寮鄉
            4317 新園鄉	4318 崁頂鄉	4319 林邊鄉	4320 南州鄉
            4321 佳冬鄉	4322 琉球鄉	4323 車城鄉	4324 滿州鄉
            4325 枋山鄉	4326 三地門鄉	4327 霧台鄉	4328 瑪家鄉
            4329 泰武鄉	4330 來義鄉	4331 春日鄉	4332 獅子鄉
            4333 牡丹鄉`
    },
    {
        city: '澎湖縣',
        districts:
            `4401 馬公市	4402 湖西鄉	4403 白沙鄉	4404 西嶼鄉
            4405 望安鄉	4406 七美鄉`
    },
    {
        city: '花蓮縣',
        districts:
            `4501 花蓮市	4502 鳳林鎮	4503 玉里鎮	4504 新城鄉
            4505 吉安鄉	4506 壽豐鄉	4507 光復鄉	4508 豐濱鄉
            4509 瑞穗鄉	4510 富里鄉	4511 秀林鄉	4512 萬榮鄉
            4513 卓溪鄉`
    },
    {
        city: '台東縣',
        districts:
            `4601 台東市	4602 成功鎮	4603 關山鎮	4604 卑南鄉
            4605 大武鄉	4606 太麻里鄉	4607 東河鄉	4608 長濱鄉
            4609 鹿野鄉	4610 池上鄉	4611 綠島鄉	4612 延平鄉
            4613 海端鄉	4614 達仁鄉	4615 金峰鄉	4616 蘭嶼鄉`
    },
    {
        city: '金門縣',
        districts:
            `9001 金城鎮	9002 金沙鎮	9003 金湖鎮	9004 金寧鄉
            9005 烈嶼鄉	9006 烏坵鄉`
    },
    {
        city: '連江縣',
        districts:
            `9101 南竿鄉	9102 北竿鄉	9103 莒光鄉	9104 東引鄉`
    }
];

export default function getDistricts (city) {
    const cityDistricts = taiwanDistricts.find((item, index, array) => {
        return item.city === city;
    });
    const districtArr = cityDistricts.districts.replace(/\s+/g, '') //去空白
                                               .split(/\d{4}/g)     //去文字, 組成陣列
                                               .filter(function(n){ return n !== "" }); //去掉空字串
    return {
        city: cityDistricts.city,
        districts: districtArr
    };
}